artillery/load-test.yml
# Archivo load-test.yml
config:
  target: "http://localhost:8080"
  phases:
    # Fase de calentamiento: carga baja durante 30 segundos
    - duration: 30
      arrivalRate: 10
      name: "Warmup"
    # Carga sostenida: nivel medio durante 2 minutos
    - duration: 120
      arrivalRate: 50
      name: "Sustained load"
    # Pico de carga: nivel alto durante 30 segundos
    - duration: 30
      arrivalRate: 150
      name: "Peak load"
    # Enfriamiento
    - duration: 30
      arrivalRate: 10
      name: "Cooldown"
  defaults:
    headers:
      Content-Type: "application/json"
      
  variables:
   region:
     - "Norte"
     - "Sur"
     - "Este"
     - "Oeste"

scenarios:
  # Escenario 1: carga mixta (escritura + lectura)
  - name: "Carga mixta OLTP"
    weight: 70
    flow:
      - post:
          url: "/pedidos"
          json:
            clienteId: "{{ $randomNumber(1, 50000) }}"
            productoId: "{{ $randomNumber(1, 10000) }}"
            categoriaId: "{{ $randomNumber(1, 50) }}"
            region: "{{ region }}"
            cantidad: "{{ $randomNumber(1, 10) }}"
            precioUnit: "{{ $randomNumber(5, 500) }}"
            canal: "web"
          capture:
            - json: "$.id"
              as: "pedidoId"
      - get:
          url: "/pedidos/{{ pedidoId }}"
      - put:
          url: "/pedidos/{{ pedidoId }}/status"
          json:
            status: "completed"

  # Escenario 2: consulta analitica por region
  - name: "Consulta analitica resumen"
    weight: 30
    flow:
      - get:
          url: "/pedidos/resumen?region={{ region }}"
      - get:
          url: "/pedidos?region={{ region }}&status=completed"